# Allow homebrew casks
tap "homebrew/cask"

# GPG
brew "gnupg"

# ZSH 
brew "zsh" 
brew "powerlevel10k"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "git"
brew "lazygit"

# Languages
brew "python"
brew "uv"
brew "gcc"
brew "cmake"

# Code writing 
brew "neovim"
cask "visual-studio-code"
cask "claude"

# Terminal Emulators
cask "alacritty"
cask "wezterm"

# Browsers
cask "brave-browser"
cask "librewolf" --no-quarantine

## LaTeX
cask "mactex-no-gui"
brew "latexindent"

## Cloud Sync 
cask "megasync"

# Work/Videocalls
cask "microsoft-teams"
cask "slack"
cask "zoom"

# VPN
brew "wireguard"
cask "nordvpn"

# Note taking
cask "obsidian"
cask "quarto"
# Window tiling managers
cask "rectangle"

# PDF reader
cask "skim"

# Messaging
cask "whatsapp"

# Academia
cask "zotero"

# Finance sheet
cask "microsoft-excel"

# Fonts
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"

# Internet speedtesting
tap "teamookla/speedtest"
