# ---------------- Taps ---------------- #
tap "homebrew/bundle"
tap "homebrew/cask"
tap "teamookla/speedtest"
# ---------------- Formulae ---------------- #

# ZSH 
brew "zsh" 
brew "powerlevel10k"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

brew "git"
brew "neovim"

# Python
brew "python"
brew "uv"

brew "node"
brew "gcc"
brew "cmake"
brew "chruby"

brew "latexindent"
brew "ruby-install"

# ---------------- Casks ---------------- #
cask "alacritty"
cask "claude"
cask "bitwarden"

# Browsers
cask "brave-browser"
cask "duckduckgo"
cask "firefox"

cask "espanso"

## LaTex
cask "mactex-no-gui"
## MEGA
cask "megasync"

# Microsoft apps
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "microsoft-word"

cask "nordvpn"
cask "obsidian"
cask "quarto"
cask "rectangle"
cask "skim"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
cask "zotero"

cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
